---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightFamily.SetLightDistributionStyle(Autodesk.Revit.DB.Lighting.LightDistributionStyle)
source: html/c572d26c-9344-9256-64b0-88b19b6d768d.htm
---
# Autodesk.Revit.DB.Lighting.LightFamily.SetLightDistributionStyle Method

Set the light distribution style to the given shape distribution

## Syntax (C#)
```csharp
public void SetLightDistributionStyle(
	LightDistributionStyle lightDistributionStyle
)
```

## Parameters
- **lightDistributionStyle** (`Autodesk.Revit.DB.Lighting.LightDistributionStyle`) - The light distribution style to set the light distribution type to

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration